import streamlit as st
import pandas as pd
from pandas import DataFrame


st.sidebar.button('HOME')
st.title("แนะนำการ์ตูน ยอดนิยม")
sport = st.sidebar.button('Sport')
fantasy = st.sidebar.button('Fantasy')
action = st.sidebar.button('Action')
comedy = st.sidebar.button('Comedy')
history = st.sidebar.button('History')

if sport:
    st.header('Yowamushi Pedal')
    st.image('https://www.anime-masters.com/upload/Yowamushi-Pedal-LIMIT-BREAK-%E0%B9%82%E0%B8%AD%E0%B8%95%E0%B8%B2%E0%B8%84%E0%B8%B8%E0%B8%99%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%AB%E0%B8%A5%E0%B9%87%E0%B8%81-%E0%B8%A0%E0%B8%B2%E0%B8%84-5.jpg?v=21')
    st.write('เรื่องย่อโอโนดะ ซากามิจิ นักเรียนหนุ่มปีหนึ่ง ขี่จักรยานไปย่านอากิบะบ่อยครั้งตั้งแต่เด็ก ด้วยจักรยานธรรมดาที่ปราศจากการปรับแต่งใดๆ ขึ้นเขาและทางลาดชันไปกลับร่วม 90 กิโลเมตร ทำให้เขามีทักษะการขี่จักรยานที่ดีแบบไม่รู้ตัว อิมาอิซึมิ จุนสุเกะ ที่ฝึกฝนเพื่อเป็นนักปั่นจักรยานมือโปร ได้สังเกตเห็นทักษะนั้น และต้องการแข่งกับเขา')

    st.header('haikyuu')
    st.image('https://vnw-img-cdn.popsww.com/api/v2/containers/file2/cms_topic/haikyo_s2_sq-d99097a035d1-1615522900146-0MjJh26o.jpg?v=0')
    st.write('เรือ่งย่อ เรื่องราวของ ฮินาตะ โชโย เด็กหนุ่มผู้เริ่มต้นเล่นวอลเลย์บอลหลังจากที่ได้เห็น "สมอลล์ไจแอนท์" ที่กำลังแข่งขันวอลเลย์บอลอยู่ ในสมัยที่เขายังเรียนในระดับประถมศึกษา หลังจากนั้น ฮินาตะ ได้ทุ่มเทอย่างมากให้กับการเล่นวอลเลย์บอล ')

    st.header('prince of tennis')
    st.image('https://m.media-amazon.com/images/M/MV5BN2U0ZDhlMTQtYzk1ZC00NTNmLWJjZWEtYzM4Mjg1NjFiNDJhXkEyXkFqcGdeQXVyODMyNTM0MjM@._V1_.jpg')
    st.write('เอจิเซ็น เรียวมะย้ายเข้ามาเรียนที่มัธยมต้นโรงเรียนเซชุนหรือในภาษาญี่ปุ่นคือ”เซซุน งาคุเอน” หรือเรียกสั่นๆว่า”เซงาคุ” โรงเรียนดังที่มีชื่อเสียงด้านเทนนิส เป็นหนุ่มน้อยอัจฉริยะ แชมป์ 4 สมัยซ้อนในการแข่งขันรุ่นจูเนียร์ของอเมริกา เรียวมะเข้าชมรมได้ไม่ทันไร ก็ไต่เต้าขึ้นเป็นนักกีฬาตัวจริงที่เป็นเด็กปี 1 คนแรกในชมรม ภายหลังจากได้เป็นตัวแทนแล้วได้ไปร่วมแข่งขันของโรงเรียนไปแข่งในระดับเขต และในรอบชิงชนะเลิศได้เจอกับโรงเรียนฟุโดมิเนะ')

    st.header('slam dunk')
    st.image('https://www.flashfly.net/wp/wp-content/uploads/2021/01/SLAM-DUNK-Mobile-21102020-1-800x450.jpg')
    st.write('ซากุรางิ ฮานามิจิ นักเรียนนักเลงที่ถูกผู้หญิงที่ตัวเองจีบ หักอกมาแล้วกว่า 50 ครั้ง และเมื่อได้เข้าเรียนที่โรงเรียนมัธยม โชโฮคุ ก็ได้พบเจอสาวงามนาม อาคางิ ฮารุโกะ และได้ตกหลุมรักทันทีที่เห็น เพื่อต้องการชนะใจเธอ ซากุรางิ จึงต้องสมัครเข้าชมรมบาสเกตบอลจากการชักชวนของเธอเพราะฮารุโกะชื่นชอบบาสเกตบอลเป็นพิเศษ ')

    st.header('kuroko no basket')
    st.image('https://inwfile.com/s-de/39kwz6.jpg')
    st.write('ตำนานแห่งทีมบาสเกตบอลของโรงเรียนมัธยมเทย์โก ที่มีผู้เล่นสุดแข็งแกร่ง 5 คน พวกเขาได้กลายเป็นที่รู้จักในฐานะ Generation of Miracles หรือ ทีมแห่งปาฏิหารย์ หลังจากที่พวกเขาจบการศึกษาจากโรงเรียนนี้แล้ว ต่างแยกย้ายไปเรียนในโรงเรียนที่มีทีมบาสเกตบอลชั้นนำ แต่มีผู้รู้ไม่กี่คนว่าความจริงแล้วยังมีผู้เล่นอีกคนในทีม เขาเปรียบเสมือนเงาของทีม อย่าง คุโรโกะ เท็ตซึยะ ที่ได้มาเป็นสมาชิกคนที่ 6 ในทีมบาสเก็ตบอลที่ไม่ค่อยมีชื่อเสียงเท่าไหร่ อย่าง โรงเรียนมัธยมปลายเซย์ริน เพื่อเป้าหมายพิชิตทั่วประเทศให้จงได้ ซึ่งต้องห้ำหั่นกับ นักบาสระดับเทพท้ง 5 คนที่กระจัดกระจาย ไปยังโรงเรียนต่างๆ นี่เอง คือตำนานบทใหม่ของนักบาสระดับเทพ คนนี้ ')

    st.header('blue lock')
    st.image('https://www.anime-masters.com/cdn-cgi/mirage/06b3b2c971b26141cef680b9ff29fd28e87fcf9b2b375898152ef66fe13dc657/1280/https://www.anime-masters.com/upload/Blue-Lock-%E0%B8%82%E0%B8%B1%E0%B8%87%E0%B8%94%E0%B8%A7%E0%B8%A5%E0%B9%81%E0%B8%82%E0%B9%89%E0%B8%87.jpg?v=21')
    st.write('หลังญี่ปุ่นตกรอบ 16 ทีมสุดท้ายบอลโลกปี 2018 ทางสมาคมทราบถึงข้อผิดพลาดสำคัญ ทำให้มีการวางแผนที่จะฝึกพิเศษให้เหล่ากองหน้ามัธยมปลาย พวกอีโก้อิซซึ่มร่วม 300 คน ให้มาอยู่ร่วมกันเพื่อฝึกที่หอพัก “บลูล็อค” เรื่องราวของพวก อิซางิ โยอิจิ ที่ไร้ชื่อเสียงและต้องการก้าวเป็นแนวหน้าของญี่ปุ่น')

if fantasy:
    st.header('sword art online')
    st.image('https://www.anime-masters.com/upload/Sword%20Art%20Online%20%E0%B8%8B%E0%B8%AD%E0%B8%A3%E0%B9%8C%E0%B8%94%E0%B8%AD%E0%B8%B2%E0%B8%A3%E0%B9%8C%E0%B8%95%E0%B8%AD%E0%B8%AD%E0%B8%99%E0%B9%84%E0%B8%A5%E0%B8%99%E0%B9%8C%20%E0%B8%A0%E0%B8%B2%E0%B8%841%20%E0%B8%9E%E0%B8%B2%E0%B8%81%E0%B8%A2%E0%B9%8C%E0%B9%84%E0%B8%97%E0%B8%A2.jpg')
    st.write('ในภาคแรกนั้นจะเป็นเรื่องราวในโลกอนาคตปี 2022 ที่เทคโนโลยีทางด้าน Visual Effect พัฒนาจนกว่าได้ว่าเป็นยุคทองของเกมออนไลน์ ที่ผู้เล่นสามารถพาตัวเองไปสู่โลกใบใหม่ที่สุดจินตนาการได้ โดยผ่านทาง NERVE GEAR ซึ่งเกมแรกที่ได้ใช้อุปกรณ์ชิ้นนี้ก็คือ SWORD ART ONLINE โปรเจ็คท์การสร้างโดย ศจ. อากิฮิโระ คายาบะ')

    st.header('fairy tail')
    st.image('https://cdn-www.bluestacks.com/bs-images/GameTile_Fairy_Tail.jpg')
    st.write('เรื่องราวกล่าวขานถึงโลกในนิยายที่ชื่อว่า "เอิร์ทแลนด์" ดินแดนที่ไม่ว่าใครก็สามารถใช้เวทมนตร์ได้ แต่การจะใช้เวทมนตร์ได้จะต้องสังกัดกิลด์ที่ถูกต้องตามกฎหมายเสียก่อน ลูซี่ ฮาร์ทฟิเลีย เด็กสาวผู้ใฝ่ฝันอยากจะเป็นหนึ่งในสมาชิกของ แฟรี่เทล กิลด์จอมเวทที่ยิ่งใหญ่ที่สุดในขณะนั้น จึงได้เดินทางออกจากคฤหาสน์ฮาร์ทฟิเลียอันเป็นบ้านเกิด เพื่อตามหาความฝันของเธอ และนั่นจึงทำให้เธอได้พบกับ นัตสึ ดรากูนีล จอมเวทผู้ใช้เวทสังหารมังกรที่เดินทางตามหา อิกนีล มังกรที่เลี้ยงเขามาตั้งแต่เด็ก และ แฮปปี้ ประชากรเผ่าเอ็กซ์ซีดที่อพยพหนีมาตั้งแต่ยังไม่เกิดและได้มาอยู่กับนัตสึและทุกคนในแฟรี่เทล นัตสึ รู้สึกถูกชะตากับลูซี่มากจึงได้ชักชวนเธอเข้ากิลด์แฟรี่เทล ')

    st.header('maou gakuin no futekigousha')
    st.image('https://www.anime-masters.com/upload/Maou-Gakuin-no-Futekigousha-2-%E0%B9%83%E0%B8%84%E0%B8%A3%E0%B8%A7%E0%B9%88%E0%B8%B2%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%80%E0%B8%AB%E0%B8%A1%E0%B8%B2%E0%B8%B0%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%88%E0%B8%AD%E0%B8%A1%E0%B8%A1%E0%B8%B2%E0%B8%A3-%E0%B8%A0%E0%B8%B2%E0%B8%84-2.jpg')
    st.write('Maou Gakuin no Futekigousha ใครว่าข้าไม่เหมาะเป็นจอมมาร หลังจากตามกวาดล้างผู้คน ภูต รวมไปถึงเหล่าเทพเจ้ามายาวนานจนเริ่มรู้สึกเบื่อหน่ายกับสงครามอันไม่มีที่สิ้นสุด จอมมารอานอสผู้โหดเหี้ยมก็วาดฝันถึงโลกที่มีแต่สันติสุขและตัดสินใจไปเกิดใหม่ ทว่าสิ่งที่รอเขาอยู่ในอีกสองพันปีให้หลังคือเหล่าผู้สืบทอดสายเลือดที่อ่อนแอลงมากเพราะคุ้นชินกับสันติภาพ นอกจากนี้วิทยาการของเวทมนตร์ยังเสื่อมถอยลงจนถึงขีดสุดอานอสได้เข้าเรียนที่ ‘โรงเรียนจอมมาร’ ซึ่งรวบรวมผู้ที่ถูกมองว่ามีสิทธิ์เป็นจอมมารที่มาเกิดใหม่ แต่ทางโรงเรียนกลับมองไม่เห็นถึงพลังที่แท้จริงและตีตราเขาว่าเป็นผู้ไร้คุณสมบัติ ขณะที่คนอื่นต่างมองเขาด้วยสายตาดูแคลน มีเพียงเด็กสาวที่ชื่อมีชาเท่านั้นที่คอยอยู่เคียงข้าง')

    st.header('Tensei shitara Slime Datta Ken')
    st.image('https://pbs.twimg.com/media/EVrZPH-WkAM1qt6.jpg ')
    st.write('มิคามิ ซาโตรุ หนุ่มโสด ไม่เคยมีแฟน วัย 37 ปี ถูกแทงตายเพราะช่วยเพื่อนจากคนร้าย Tensei shitara Slime Datta Ken เขาได้เกิดใหม่ในต่างโลกด้วยร่างของสไลม์ ได้พบมังกร เวรุโดร่า ผู้ถูกผนึกมาร่วม 3 ร้อยปีและรู้ว่าเขามาจากต่างโลก ด้วยความเบื่อหน่ายในชีวิตจึงยอมเป็นเพื่อนกับสไลม์ ตั้งชื่อให้เขา “ริมุรุ” และให้เขากลืนตนเข้าไปในร่าง ด้วย2 ความสามารถ “นักล่า” ที่ทำให้เขาสามารถชิงความสามารถของผู้ถูกกลืน และ “ปราชญ์ผู้ยิ่งใหญ่” ทำให้เขาเข้าใจเรื่องราวในโลกใหม่ ส่งผลให้เขาพัฒนาเป็นสไลม์ที่น่าเกรงขามต่อเหล่ามอนสเตอร์ทั่วไป จนกลายเป็นปีศาจที่ยิ่งใหญ่ในภายหลัง')

    st.header('Mairimashita! Iruma-kun')
    st.image('https://cdn.myanimelist.net/images/anime/1009/103187.jpg')
    st.write('สึซึกิ อิรุมะ หนุ่มนิสัยดีวัย 14 ปีที่ถูกขายให้กับปีศาจ แต่กลับกลายเป็นว่า ปีศาจต้องการได้เขาเป็นหลาน และส่งให้เขาไปเรียนต่อในโรงเรียนปีศาจที่เป็นผู้อำนวยการอยู่ อิรุมะ ต้องเรียนร่วมกับปีศาจตนอื่นในฐานะนักเรียนหน้าใหม่ ถึงจะอ่อนแอ ไม่ปฏิเสธคนที่เดือดร้อน แต่เนื่องจากหนีปัญหามาทั้งชีวิต ทำให้เขามีความสามารถการป้องกันตัว (หลบหลีก) ที่ไร้ขีดจำกัด จนยากที่จะโดนโจมตีจากคู่ต่อสู้ ')

    st.header('Mushoku Tensei ')
    st.image('https://cdn.myanimelist.net/images/about_me/ranking_items/14742524-97a69d40-ce70-4da0-ae2d-c1002ab846ad.jpg?t=1663366190')
    st.write('ทันทีที่นีทอายุ 34 ปีที่ยังซิง ไม่มีทางทำแถมยังเป็นฮิคิโคโมริถูกไล่ออกจากบ้านในวันงานศพของพ่อแม่ เขาก็ถูกรถบรรทุกชนจนต้องจบชีวิตลง ทว่า เมื่อลืมตาตื่นขึ้นมาอีกทีเขาก็พบว่าตัวเองกลับชาติไปเกิดใหม่เป็นเด็กทารกในโลกแห่งดาบและเวทมนตร์เสียแล้ว! ชายผู้ใช้ชีวิตมาราวกับเศษสวะได้สาบานกับตัวเองว่าเขาจะใช้ชีวิตอย่างจริงจังในต่างโลกนี้ ในฐานะรูเดียส สิ่งที่รูเดียสจะได้พบก็คือนักเวทโลลิ เพื่อนสมัยเด็กที่มีหูเอลฟ์ และคุณหนูซึนเดเระสุดอันตราย นอกจากนี้เองเขาก็จะได้พบกับผู้คนมากมาย และเผชิญหน้ากับการผจญภัยอันโหดร้าย แฟนตาซี "การแก้ไขชีวิตใหม่" กำลังจะเริ่มขึ้นแล้ว')

if action:
    st.header('Record of Ragnarok')
    st.image('https://www.โอตาคุแว่นผู้หนึ่ง.com/wp-content/uploads/2022/11/Record-of-Ragnarok-%E0%B8%A1%E0%B8%AB%E0%B8%B2%E0%B8%A8%E0%B8%B6%E0%B8%81%E0%B8%84%E0%B8%99%E0%B8%8A%E0%B8%99%E0%B9%80%E0%B8%97%E0%B8%9E-Key-Visaul-6.png')
    st.write('เรื่องราวเริ่มขึ้นเมื่อเหล่าเทพเจ้าได้มาประชุมกัน ด้วยหัวข้อที่ว่าจะทำลายล้างมนุษยชาติ เพราะมนุษย์นั้นตกต่ำและทำลายโลกกับสิ่งแวดล้อมจึงไม่คู่ควรที่จะมีชีวิตอยู่ต่อ แต่ในขณะนั้น บรุนฮิลด์ พี่ใหญ่แห่งสิบสามพี่น้องวัลคีรี่ ได้เข้ามายื่นข้อเสนอเพื่อที่จะต่อชีวิตให้มนุษย์อีกพันปี และข้อเสนอที่ว่าก็คือการเปิดศึก แร็กนาร็อก (ศึกต่อสู้ระหว่างเทพกับมนุษย์) โดยศึกครั้งนี้จะให้ทั้งสองฝ่ายคัดเลือกตัวแทนจำนวน 13 คน มาสู้กันแบบตัวต่อตัว หากฝ่ายใดชนะก่อน 7 ครั้ง ก็ถือว่าเป็นผู้ชนะศึกครั้งนี้ และนั่นก็หมายความว่า หากฝ่ายมนุษย์เป็นผู้ชนะก็มีสิทธิ์ที่จะอยู่รอดต่อไปได้อีกพันปี มาลุ้นกันครับว่า ศึกนี้มนุษย์ธรรมดาจะสามารถเอาชนะเหล่าทวยเทพที่แข็งแกร่งแล้วมีชีวิตอยู่ได้หรือเปล่า?')

    st.header('Kimetsu No Yaiba')
    st.image('https://www.dailynews.co.th/wp-content/uploads/2022/12/aHR0cHM6Ly9zLmlzYW5vb2suY29tL2dhLzAvdWQvMjMzLzExNjczMTMva2ltZXRzdV9ub195YWliYV9kZW1vbl9zbGF5ZXJfMS5qcGc.jpg')
    st.write('ทันจิโร่ เป็นเด็กหนุ่มผู้มีจิตใจอ่อนโยนและเฉลียวฉลาด ในฐานะลูกชายคนโตของครอบครัวคนเผาถ่าน หัวเรี่ยวหัวแรงในการหารายได้เลี้ยงดูครอบครัวจากการเผาถ่านไปขายหลังจากพ่อของเขาเสียชีวิต ทุกสิ่งทุกอย่างได้เปลี่ยนแปลงไปเมื่อมีอสูรบุกเข้ามาสังหารคนในครอบครัวของทันจิโร่ เหลือแต่เพียงเขาและน้องสาวที่ชื่อ เนะซึโกะ เท่านั้น เนะซึโกะที่รอดตายมาได้กลับกลายเป็นอสูรไป ทว่าก็น่าประหลาดใจที่เธอยังคงมีความคิดและการแสดงอารมณ์อย่างมนุษย์หลงเหลืออยู่ หลังจากที่ทันจิโร่ได้ต่อสู้กับโทมิโอะกะ กิยู นักล่าอสูรที่เดินทางผ่านมาและต้องการจะฆ่าเนะซึโกะที่กลายเป็นอสูรไปแล้ว เขาจึงตัดสินใจที่จะเป็นนักล่าอสูรตามคำชักชวนของกิยู เพื่อหาทางทำให้น้องสาวกลับมาเป็นมนุษย์ และชำระแค้นจากอสูรที่ฆ่าคนในครอบครัวของเขาให้จงได้')

    st.header('jujutsu kaisen')
    st.image('https://cms.dmpcdn.com/moviearticle/2021/07/30/2abfd920-f0f2-11eb-8217-8759e1bcd621_original.jpg')
    st.write('นักเรียนมัธยมปลายที่มีสมรรถภาพร่างกายสูงแต่เลี่ยงกีฬามาอยู่กลุ่มเหนือธรรมชาติ ก่อนปู่ตายได้ฝากให้เขาคิดถึงการช่วยผู้อื่นและตายอย่างเหมาะสม เขาได้มาพัวพันกับ “วัตถุต้องสาป” ที่ทำให้สัตว์ประหลาดปรากฏตัว ยูจิ และกลืนนิ้วต้องสาปเข้าไปเพื่อช่วยพวกรุ่นพี่ ถึงพลังคำสาปของนิ้วเทพอสูร เรียวเมน สุคุนะ จะมีพลังรุนแรง แต่กลับไม่สามารถควบคุมร่างเขาได้ ทำให้กลุ่มสมาคมไสยเวทตั้งใจให้เขารวบรวมนิ้วต้องคำสาปของเทพอสูรทั้งหมดรวม 20 นิ้ว (มี 4 แขน) แล้วค่อยกำจัด ยูจิ ในภายหลัง ซึ่งเขายอมรับข้อเสนอนั้นเพื่อช่วยเหลือผู้คนที่อาจเดือดร้อนกับคำสาปเหล่านี้ และเข้าเรียนในโรงเรียนไสยเวทที่โตเกียว มีเพื่อนในชั้นปี 1 อีกสองคน คือ เมกุมิ และ โนบาระ')

    st.header('dragon ball super')
    st.image('http://f.ptcdn.info/973/047/000/oiagngcsrCZsYzeSj5x-o.jpg')
    st.write('เป็นเนื้อเรื่องหลังจบศึกการต่อสู้กับจอมมารบู ซึ่งโลกสงบสุขไปนานหลายปี แต่แล้วพวกโกคูก็ต้องพบกับศึกครั้งใหม่ ซึ่งจะไม่เหมือนกับตอนภาค GT โดยคราวนี้ทางอาจารย์โทริยามะ อากิระ จะเป็นจะเป็นคนเขียนบทและกำกับการสร้าง ร่วมกับทาง Fuji TV ด้วยตัวเองกันเลย ')

    st.header('myheroacademia')
    st.image('https://img1.hotstarext.com/image/upload/f_auto/sources/r1/cms/prod/813/1230813-h-b3813f21e58e')
    st.write(' มนุษย์เกิดมาไม่เท่าเทียมกัน! เด็กบางคนเกิดมาพร้อมพลังพิเศษที่เรียกว่า “อัตลักษณ์” แต่ “อิซาคุ” เป็นพวกไม่มีพลังใดๆ และถูกเพื่อนที่มีพลังพิเศษแกล้งตั้งแต่เด็ก ด้วยความชื่นชม All-Might ฮีโร่ในดวงใจทำให้เขามุ่งมั่นที่จะเป็นฮีโร่ผู้ผดุงความยุติธรรม')

    st.header('One Punch Man ')
    st.image('https://f.ptcdn.info/808/078/000/rk42h22b7hzh2GRquDN75-o.jpg')
    st.write('เนื้อเรื่องย่อ เริ่มต้นในเมือง Z-city โลกนี้มีสัตว์ประหลาดและสิ่งมีชีวิตที่แปลกประหลาดมากมายที่ปรากฏตัวและสร้างความวุ่นวาย ไซตามะฮีโร่ที่แข็งแกร่งที่สุดที่สามารถโค่นเหล่าร้ายได้ภายในหมัดๆเดียว แต่ว่าเมื่อไซตามะแข็งแกร่งเกินไป เขาก็เริ่มเบื่อในพลังของตัวเองและพยายามหาคู่ต่อสู้ที่สูสีกับเขา ในการผจญภัยของเขา ทำให้เขาได้พบทั้งเพื่อนใหม่, ศัตรู, และยังได้ลูกศิษย์มา เขาเป็นไซบอร์คชื่อว่าจีนอส ทั้งคู่ได้ร่วมสมาคมซูเปอร์ฮีโร่เพื่อปกป้องโลก และจัดการเหล่าศัตรูไปได้มากมาย')

if comedy:
    st.header('dr.stone')
    st.image('https://m.media-amazon.com/images/M/MV5BYmU2MzEyMjAtOTQ5Yy00NGMxLTg0NmItMTQ0ZTM5OGY0NjUzXkEyXkFqcGdeQXVyNjAwNDUxODI@._V1_.jpg')
    st.write('วันหนึ่งก้เกิดแสงประหลาดสาดส่องเข้าหาโลกทั้งใบและผลของแสงนั้นทำให้มนุษย์บนโลกกลายเป็นหิน และโลกก็ตกอยู่ในความเงียบงันล่วงเลยมานับพันปี จนกระทั่งเกิดเหตุการณ์ที่ไม่คาดคิดขึ้น มนุษย์ผู้คู่หนึ่งที่เป็นหินมานานนับพันปีก็ตื่นและกระเทาะจากหินออกมา นั่นคือเด็กหนุ่มที่ชื่อเซนคู ผู้มีมันสมองเป็นเลิศและ ไทจุ ผู้มีพลังเป็นเลิศ ได้ตื่นขึ้นมาอีกครั้ง ทั้งสองจะเอาตัวรอดยังไงบนโลกที่เต็มไปด้วยหินและสัตว์ป่า พร้อมทั้งไขปริศนาว่าแสงนั้นคือสิ่งใดที่ทำให้มนุษย์ทั้งโลกหยุดนิ่ง ร่วมหาคำตอบกันได้ใน… DR.STON')

    st.header('doraemon')
    st.image('https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSEkvRntVriVnIGStkBnAuIYb6sWm1LdrgXg&usqp=CAU')
    st.write('เนื้อเรื่องส่วนมากจะเกี่ยวกับปัญหาของ โนบิตะ เด็กชายชั้น ป.4 ที่มักถูกเพื่อน ๆ แกล้ง (แต่บ่อยครั้งก็เป็นฝ่ายหาเรื่องใส่ตัวเอง) ไม่ค่อยชอบทำการบ้าน ไม่ชอบอ่านหนังสือและไปโรงเรียนสายบ่อย ๆ โดยมีเพื่อนที่เป็นตัวละครสำคัญในเรื่องคือ โดราเอมอน (โนบิตะทำอะไรไม่ค่อยเป็น ต้องพึ่งโดราเอมอนแทบทุกอย่าง) หุ่นยนต์แมวจากอนาคตที่คอยดูแลช่วยเหลือโนบิตะตลอดเวลาด้วยของวิเศษจากอนาคต ')

    st.header('shin chan')
    st.image('https://m.media-amazon.com/images/M/MV5BNDQ3NTczMmEtMzhhNy00NDRlLWFmMDktNjE0ZTRkZTc1ZGI0XkEyXkFqcGdeQXVyNTk5ODg4NDA@._V1_.jpg')
    st.write('เนื้อเรื่องเกี่ยวกับชินจัง (โนะฮาร่า ชินโนะสุเกะ; Nohara Shinnosuke) เด็กอนุบาลวัย 5 ขวบ ผู้มีนิสัยทะลึ่งและแก่แดดเกินวัย เช่น ชอบผู้หญิงหุ่นดีหน้าตาดี พ่อของชินจัง (โนฮาร่า ฮิโรชิ ) เป็นคนที่ ชอบทำเท่ให้สาวๆเห็น ชาวสาวหุ่นดีหน้าตาดี')

    st.header('gintama')
    st.image('https://www.kartoon-discovery.com/focus/shortfocus/shortfocus_pics/gintama.jpg')
    st.write('เป็นเรื่องราวเกี่ยวกับซากาตะ กินโทกิ อดีตซามูไรที่ทำอาชีพรับจ้างอิสระพร้อมด้วย ชิมูระ ชินปาจิ และ คางุระ เพื่อหาเงินมาเลี้ยงชีพในยุคที่ซามูไรตกต่ำ เนื่องจากการรุกรานของมนุษย์ต่างดาว เนื้อเรื่องเป็นการผสมผสานระหว่างแนวย้อนยุคและแนววิทยาศาสตร์ ลักษณะแนวเรื่องเป็นแนวตลกและต่อสู้ ในญี่ปุ่น')

    st.header('spy x family')
    st.image('https://cheezelooker.com/file_managers/uploads/file_managers/source/2022%20DAILY%20CULTURE/JUNE/WEEK%204/SPY%20X%20FAMILY%20PART%202/image_2022-06-01_163753890.png')
    st.write('สุดยอดสปาย (สนธยา) ได้รับคำสั่งให้สร้าง ครอบครัว เพื่อลอบเข้าไปในโรงเรียนชื่อดัง แต่ ลูกสาว ที่เขาได้พบดันเป็นผู้มีพลังจิตอ่านใจคน! ภรรยา เป็นมือสังหาร!? โฮมคอเมดี้สุดฮาของครอบครัวปลอมๆ ที่ต่างฝ่ายต่างปกปิดตัวจริงของกันและกัน ที่ต้องเผชิญหน้ากับการสอบเข้าและปกป้องโลก')

    st.header('Dr. Slump-Arale Chan')
    st.image('https://borkormee.com/wp-content/uploads/2021/01/135341ad-1024x580.jpg')
    st.write('เรื่องเกิดขึ้นในหมู่บ้านเพนกวิน โดย ดร. เซมเบ้ หรือ ดร.โนริมากิ เซมเบ้ ซึ่งเป็นนักประดิษฐ์ ได้ทำการประดิษฐ์หุ่นยนต์ที่เหมือนมนุษย์ที่ชื่อว่า โนริมากิ อาราเล ขึ้นมา แต่ในเวอร์ชันใหม่นั้น ดร.สลัมป์ตั้งใจจะสร้างหุ่นยนต์คนใช้สุดสวย แต่ได้เกิดฟ้าผ่าขึ้น จนทำให้อุปกรณ์ได้รวนขึ้นมา แล้วสร้างหุ่นยนต์เด็กผู้หญิงมาแทน หลังจากนั้น ก็ได้พบกับไข่ในยุคไดโนเสาร์ ซึ่งฟักออกมาแล้วก็ได้เด็กผมสีเขียว (ในเวอร์ชันใหม่เป็นสีทอง) อาราเลได้ตั้งชื่อว่า "โนริมากิ กั๊ตซิลล่า" ซึ่งเป็นคำประสมระหว่าง ก็อตซิลล่ากับกาเมล่า โดยเรียกสั้น ๆ ว่า "กั๊ตจัง"')

if history:
    st.write('ประเทศญี่ปุ่นเริ่มผลิตภาพยนตร์แอนิเมชันในเชิงพาณิชย์ตั้งแต่ปี ค.ศ. 1917 แต่ภาพลักษณ์ในฐานะสื่อสำหรับเด็กของภาพยนตร์การ์ตูนทำให้การเผยแพร่ยังมีอยู่อย่างจำกัด และแผ่นดินไหวใหญ่ในที่ราบคันโตเมื่อ ปี 1923 ทำให้สตูดิโอและงานในยุคแรกเริ่มถูกทำลายไปเป็นจำนวนมาก. การ์ตูนอนิเมะเรื่องยาวเรื่องแรก คือ โมโมทาโร่ อุมิโนะชินเปอิ (桃太郎 海の神兵) หรือ โมโมทาโร่ ทหารเทพแห่งท้องทะเล ซึ่งถูกสร้างขึ้นโดยราชนาวีของจักรวรรดิ์ญี่ปุ่น ในปี ค.ศ. 1944 เพื่อใช้ในการโฆษณาชวนเชื่อในระหว่างสงคราม. พอถึงยุคหลังสงครามความนิยมในภาพยนตร์แอนิเมชันก็ได้รับการฟื้นฟูเป็นลำดับ. จนกระทั่งในทศวรรศที่ 1960 นักสร้างแอนิเมชันอย่าง เทะซิกะ โอซามุ ได้บุกเบิกเทคนิคในการสร้างภาพยนตร์การ์ตูนในญี่ปุ่น โดยการศึกษาเลียนแบบเทคนิคของนักทำแอนิเมชันของดิสนีย์และคิดหาทางลดความยุ่งยากและค่าใช้จ่ายลง. ผลงานของโอซามุได้รับความนิยมแพร่หลายไปนอกประเทศญี่ปุ่น และได้รับฉายทั้งในอเมริกาและประเทศในยุโรปหลายเรื่อง. พอถึงปลายปี 1970 ภาพยนตร์การ์ตูนญี่ปุ่นได้พัฒนาลักษณะเฉพาะตัวขึ้นจนสามารถแบ่งแยกออกจากภาพยนตร์การ์ตูนของสหรัฐอเมริกาได้อย่างชัดเจน. ในทศวรรษที่ 1980 อนิเมะได้รับความนิยมกว้างขวางในญี่ปุ่น ทำให้ธุรกิจการสร้างอนิเมะเจริญเติบโตอย่างรวดเร็ว และในทศวรรษที่ 1990 และ 2000 ชื่อเสียงของอนิเมะได้แพร่ขยายไปยังนอกประเทศญี่ปุ่น พร้อม ๆ กับการขยายตัวของตลาดอนิเมะนอกประเทศสำหรับคนที่ชื่นชอบ')


a = st.sidebar.button('จำนวนตอนการ์ตูน')
if a:
    excel_file = ''
    df = pd.read_excel('anime.xlsx')

    # สร้าง UI ด้วย Streamlit
    st.write(df)

st.markdown(
    f"""
       <style>
       .stApp {{
           background-image: url("https://wallpaperaccess.com/full/1761712.jpg");
           background-attachment: fixed;
           background-size: cover;
           /* opacity: 0.3; */
       }}
       </style>
       """,
    unsafe_allow_html=True
)


